Model: "image_discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_encoder_or_discriminat [(None, 64, 64, 3)]       0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 64, 64, 3)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 32, 32, 64)        1792      
_________________________________________________________________
gaussian_dropout_6 (Gaussian (None, 32, 32, 64)        0         
_________________________________________________________________
layer_normalization_13 (Laye (None, 32, 32, 64)        128       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 16, 16, 64)        36928     
_________________________________________________________________
gaussian_dropout_7 (Gaussian (None, 16, 16, 64)        0         
_________________________________________________________________
layer_normalization_14 (Laye (None, 16, 16, 64)        128       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 8, 8, 128)         73856     
_________________________________________________________________
gaussian_dropout_8 (Gaussian (None, 8, 8, 128)         0         
_________________________________________________________________
layer_normalization_15 (Laye (None, 8, 8, 128)         256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
gaussian_dropout_9 (Gaussian (None, 4, 4, 128)         0         
_________________________________________________________________
layer_normalization_16 (Laye (None, 4, 4, 128)         256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
gaussian_dropout_10 (Gaussia (None, 4, 4, 128)         0         
_________________________________________________________________
layer_normalization_17 (Laye (None, 4, 4, 128)         256       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 4, 4, 256)         295168    
_________________________________________________________________
gaussian_dropout_11 (Gaussia (None, 4, 4, 256)         0         
_________________________________________________________________
layer_normalization_18 (Laye (None, 4, 4, 256)         512       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 4097      
_________________________________________________________________
encoder_or_discriminator_out (None, 1)                 0         
=================================================================
Total params: 708,545
Trainable params: 0
Non-trainable params: 708,545
_________________________________________________________________
