Model: "latent_discriminator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 70)]         0                                            
__________________________________________________________________________________________________
gaussian_noise_2 (GaussianNoise (None, 70)           0           input_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           1136        gaussian_noise_2[0][0]           
__________________________________________________________________________________________________
gaussian_dropout_12 (GaussianDr (None, 16)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
layer_normalization_19 (LayerNo (None, 16)           32          gaussian_dropout_12[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 16)           0           layer_normalization_19[0][0]     
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 86)           0           gaussian_noise_2[0][0]           
                                                                 leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           1392        concatenate_6[0][0]              
__________________________________________________________________________________________________
gaussian_dropout_13 (GaussianDr (None, 16)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
layer_normalization_20 (LayerNo (None, 16)           32          gaussian_dropout_13[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 16)           0           layer_normalization_20[0][0]     
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 102)          0           concatenate_6[0][0]              
                                                                 leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 16)           1648        concatenate_7[0][0]              
__________________________________________________________________________________________________
gaussian_dropout_14 (GaussianDr (None, 16)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
layer_normalization_21 (LayerNo (None, 16)           32          gaussian_dropout_14[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 16)           0           layer_normalization_21[0][0]     
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 118)          0           concatenate_7[0][0]              
                                                                 leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 16)           1904        concatenate_8[0][0]              
__________________________________________________________________________________________________
gaussian_dropout_15 (GaussianDr (None, 16)           0           dense_7[0][0]                    
__________________________________________________________________________________________________
layer_normalization_22 (LayerNo (None, 16)           32          gaussian_dropout_15[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 16)           0           layer_normalization_22[0][0]     
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 134)          0           concatenate_8[0][0]              
                                                                 leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 16)           2160        concatenate_9[0][0]              
__________________________________________________________________________________________________
gaussian_dropout_16 (GaussianDr (None, 16)           0           dense_8[0][0]                    
__________________________________________________________________________________________________
layer_normalization_23 (LayerNo (None, 16)           32          gaussian_dropout_16[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 16)           0           layer_normalization_23[0][0]     
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 150)          0           concatenate_9[0][0]              
                                                                 leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 16)           2416        concatenate_10[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_17 (GaussianDr (None, 16)           0           dense_9[0][0]                    
__________________________________________________________________________________________________
layer_normalization_24 (LayerNo (None, 16)           32          gaussian_dropout_17[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 16)           0           layer_normalization_24[0][0]     
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 166)          0           concatenate_10[0][0]             
                                                                 leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 16)           2672        concatenate_11[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_18 (GaussianDr (None, 16)           0           dense_10[0][0]                   
__________________________________________________________________________________________________
layer_normalization_25 (LayerNo (None, 16)           32          gaussian_dropout_18[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 16)           0           layer_normalization_25[0][0]     
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 182)          0           concatenate_11[0][0]             
                                                                 leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 16)           2928        concatenate_12[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_19 (GaussianDr (None, 16)           0           dense_11[0][0]                   
__________________________________________________________________________________________________
layer_normalization_26 (LayerNo (None, 16)           32          gaussian_dropout_19[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 16)           0           layer_normalization_26[0][0]     
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 198)          0           concatenate_12[0][0]             
                                                                 leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 16)           3184        concatenate_13[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_20 (GaussianDr (None, 16)           0           dense_12[0][0]                   
__________________________________________________________________________________________________
layer_normalization_27 (LayerNo (None, 16)           32          gaussian_dropout_20[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 16)           0           layer_normalization_27[0][0]     
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 214)          0           concatenate_13[0][0]             
                                                                 leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 16)           3440        concatenate_14[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_21 (GaussianDr (None, 16)           0           dense_13[0][0]                   
__________________________________________________________________________________________________
layer_normalization_28 (LayerNo (None, 16)           32          gaussian_dropout_21[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 16)           0           layer_normalization_28[0][0]     
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 230)          0           concatenate_14[0][0]             
                                                                 leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 16)           3696        concatenate_15[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_22 (GaussianDr (None, 16)           0           dense_14[0][0]                   
__________________________________________________________________________________________________
layer_normalization_29 (LayerNo (None, 16)           32          gaussian_dropout_22[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 16)           0           layer_normalization_29[0][0]     
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 246)          0           concatenate_15[0][0]             
                                                                 leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 16)           3952        concatenate_16[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_23 (GaussianDr (None, 16)           0           dense_15[0][0]                   
__________________________________________________________________________________________________
layer_normalization_30 (LayerNo (None, 16)           32          gaussian_dropout_23[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 16)           0           layer_normalization_30[0][0]     
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 262)          0           concatenate_16[0][0]             
                                                                 leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 16)           4208        concatenate_17[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_24 (GaussianDr (None, 16)           0           dense_16[0][0]                   
__________________________________________________________________________________________________
layer_normalization_31 (LayerNo (None, 16)           32          gaussian_dropout_24[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 16)           0           layer_normalization_31[0][0]     
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 278)          0           concatenate_17[0][0]             
                                                                 leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 16)           4464        concatenate_18[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_25 (GaussianDr (None, 16)           0           dense_17[0][0]                   
__________________________________________________________________________________________________
layer_normalization_32 (LayerNo (None, 16)           32          gaussian_dropout_25[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 16)           0           layer_normalization_32[0][0]     
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 294)          0           concatenate_18[0][0]             
                                                                 leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 16)           4720        concatenate_19[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_26 (GaussianDr (None, 16)           0           dense_18[0][0]                   
__________________________________________________________________________________________________
layer_normalization_33 (LayerNo (None, 16)           32          gaussian_dropout_26[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 16)           0           layer_normalization_33[0][0]     
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 310)          0           concatenate_19[0][0]             
                                                                 leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 16)           4976        concatenate_20[0][0]             
__________________________________________________________________________________________________
gaussian_dropout_27 (GaussianDr (None, 16)           0           dense_19[0][0]                   
__________________________________________________________________________________________________
layer_normalization_34 (LayerNo (None, 16)           32          gaussian_dropout_27[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 16)           0           layer_normalization_34[0][0]     
__________________________________________________________________________________________________
concatenate_21 (Concatenate)    (None, 326)          0           concatenate_20[0][0]             
                                                                 leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 128)          41856       concatenate_21[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 128)          0           dense_20[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1)            129         leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 1)            0           dense_21[0][0]                   
==================================================================================================
Total params: 91,393
Trainable params: 0
Non-trainable params: 91,393
__________________________________________________________________________________________________
