Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_encoder_or_discriminat [(None, 64, 64, 3)]       0         
_________________________________________________________________
gaussian_noise (GaussianNois (None, 64, 64, 3)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 64)        3136      
_________________________________________________________________
gaussian_dropout (GaussianDr (None, 32, 32, 64)        0         
_________________________________________________________________
layer_normalization_7 (Layer (None, 32, 32, 64)        128       
_________________________________________________________________
activation_8 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 16, 16, 64)        65600     
_________________________________________________________________
gaussian_dropout_1 (Gaussian (None, 16, 16, 64)        0         
_________________________________________________________________
layer_normalization_8 (Layer (None, 16, 16, 64)        128       
_________________________________________________________________
activation_9 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 128)         131200    
_________________________________________________________________
gaussian_dropout_2 (Gaussian (None, 8, 8, 128)         0         
_________________________________________________________________
layer_normalization_9 (Layer (None, 8, 8, 128)         256       
_________________________________________________________________
activation_10 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 4, 4, 128)         262272    
_________________________________________________________________
gaussian_dropout_3 (Gaussian (None, 4, 4, 128)         0         
_________________________________________________________________
layer_normalization_10 (Laye (None, 4, 4, 128)         256       
_________________________________________________________________
activation_11 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 4, 4, 128)         262272    
_________________________________________________________________
gaussian_dropout_4 (Gaussian (None, 4, 4, 128)         0         
_________________________________________________________________
layer_normalization_11 (Laye (None, 4, 4, 128)         256       
_________________________________________________________________
activation_12 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 4, 4, 256)         524544    
_________________________________________________________________
gaussian_dropout_5 (Gaussian (None, 4, 4, 256)         0         
_________________________________________________________________
layer_normalization_12 (Laye (None, 4, 4, 256)         512       
_________________________________________________________________
activation_13 (Activation)   (None, 4, 4, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 70)                286790    
_________________________________________________________________
encoder_or_discriminator_out (None, 70)                0         
=================================================================
Total params: 1,537,350
Trainable params: 1,537,350
Non-trainable params: 0
_________________________________________________________________
