Model: "generator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 70)]         0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           4544        input_1[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         72704       input_1[0][0]                    
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 64)           128         dense_1[0][0]                    
__________________________________________________________________________________________________
layer_normalization (LayerNorma (None, 1024)         2048        dense[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64)           0           layer_normalization_1[0][0]      
__________________________________________________________________________________________________
activation (Activation)         (None, 1024)         0           layer_normalization[0][0]        
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 1, 64)     0           activation_1[0][0]               
__________________________________________________________________________________________________
reshape (Reshape)               (None, 4, 4, 64)     0           activation[0][0]                 
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 4, 4, 64)     0           reshape_1[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 4, 4, 128)    0           reshape[0][0]                    
                                                                 up_sampling2d[0][0]              
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 8, 8, 128)    0           concatenate[0][0]                
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 8, 8, 256)    524544      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 8, 8, 256)    512         conv2d[0][0]                     
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 256)    0           layer_normalization_2[0][0]      
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 8, 8, 64)     0           up_sampling2d[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 8, 320)    0           activation_2[0][0]               
                                                                 up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 16, 16, 320)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 16, 128)  655488      up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 16, 16, 128)  256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 16, 16, 128)  0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 16, 16, 64)   0           up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 16, 16, 192)  0           activation_3[0][0]               
                                                                 up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 32, 32, 192)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 128)  393344      up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 32, 32, 128)  256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 128)  0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 32, 32, 64)   0           up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 32, 192)  0           activation_4[0][0]               
                                                                 up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 64, 64, 192)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 64, 64)   196672      up_sampling2d_7[0][0]            
__________________________________________________________________________________________________
layer_normalization_5 (LayerNor (None, 64, 64, 64)   128         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 64, 64)   0           layer_normalization_5[0][0]      
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, 64, 64, 64)   0           up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 64, 64, 128)  0           activation_5[0][0]               
                                                                 up_sampling2d_8[0][0]            
__________________________________________________________________________________________________
up_sampling2d_9 (UpSampling2D)  (None, 64, 64, 128)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 64, 64)   131136      up_sampling2d_9[0][0]            
__________________________________________________________________________________________________
layer_normalization_6 (LayerNor (None, 64, 64, 64)   128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 64, 64, 64)   0           layer_normalization_6[0][0]      
__________________________________________________________________________________________________
up_sampling2d_10 (UpSampling2D) (None, 64, 64, 64)   0           up_sampling2d_8[0][0]            
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 64, 64, 128)  0           activation_6[0][0]               
                                                                 up_sampling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 3)    6147        concatenate_5[0][0]              
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 3)    0           conv2d_5[0][0]                   
==================================================================================================
Total params: 1,988,035
Trainable params: 1,988,035
Non-trainable params: 0
__________________________________________________________________________________________________
