Model: "discriminator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 64, 64, 3)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 128)       9728      
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 256)       819456    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 16, 16, 256)       0         
_________________________________________________________________
dropout (Dropout)            (None, 16, 16, 256)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 512)         3277312   
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 8, 8, 512)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 1004)        12852204  
_________________________________________________________________
batch_normalization (BatchNo (None, 4, 4, 1004)        4016      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 4, 4, 1004)        0         
_________________________________________________________________
flatten (Flatten)            (None, 16064)             0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16064)             0         
_________________________________________________________________
dense (Dense)                (None, 1)                 16065     
=================================================================
Total params: 16,978,781
Trainable params: 16,976,773
Non-trainable params: 2,008
_________________________________________________________________
