Model: "generator"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 8192)              1056768   
_________________________________________________________________
reshape (Reshape)            (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 16, 16, 128)       262272    
_________________________________________________________________
batch_normalization (BatchNo (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 32, 32, 256)       524544    
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 256)       1024      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 64, 64, 512)       2097664   
_________________________________________________________________
batch_normalization_2 (Batch (None, 64, 64, 512)       2048      
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 64, 64, 512)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 64, 3)         38403     
=================================================================
Total params: 3,983,235
Trainable params: 3,981,443
Non-trainable params: 1,792
_________________________________________________________________
